package com.lenovo.smarttraffic.bean;

import java.util.List;

public class NewsInfo {

    /**
     * ROWS_DETAIL : [{"id":1,"category":1,"title":"福州地铁2号线本月下旬试乘运营","content":"福州地铁2号线本月下旬试乘运营，南门兜站施工正在全力冲刺；设8个进出口，换乘跑离约百米","createtime":"2019-04-10 08:19:21"},{"id":2,"category":1,"title":"福建全省今年以来有104人被终生禁驾 多数为交通事故逃逸","content":"福建省公安厅交警总队日前公布2019年第一季度全省104名被终生禁驾人员名单，此次公布的全省104名终生禁驾人员中，81人是因为驾驶人在发生重大交通事故构成犯罪逃逸被终身禁驾，23人是因为驾驶人饮酒后或者醉酒驾驶机动车发生重大交通事故构成犯罪被终身禁驾。","createtime":"2019-04-11 22:48:45"},{"id":3,"category":3,"title":"首山路拥堵","content":"一场大雨让首山路积水，道路一下拥堵了不少","createtime":"2019-03-14 12:49:08"},{"id":4,"category":1,"title":"大众进口汽车Golf 旅行轿车正式上市 售价20.98万元","content":"大众进口汽车Golf 旅行轿车正式上市 售价20.98万元","createtime":"2019-04-10 09:19:15"},{"id":5,"category":3,"title":"北二环拥堵","content":"下班时间，北二环往武警医院方向已经开始排起了长队","createtime":"2019-03-14 12:49:08"},{"id":6,"category":1,"title":"清明小长假福建省高速公路总交通流量突破810万辆次","content":"4月5日零时至4月7日15时，全省高速公路出入口总交通流量810.1万辆次，同比增长12.4%；7座及以下小型客车出入口总流量711.2万辆次，占总车流量的87.78%，同比增长12.96%。","createtime":"2019-04-10 10:49:08"},{"id":7,"category":2,"title":"遥控器中轻触开关的作用","content":"轻触开关的推陈出新带动了现代电子制造行业的创新意念，带动了现代电子制造种类的丰富多彩发展","createtime":"2019-05-20 10:10:38"},{"id":8,"category":2,"title":"互联网时代如何保护隐私","content":"互联网时代，接踵体验新技术的欢欣而来的，还有隐私被侵犯的深深无力感。60万旅客及410万联系人信息，约2亿份个人简历，以及约3.83亿酒店住客信息\u2026\u2026这是2018年底一个月内发生的隐私泄漏事件的一部分。根据Gemalto的统计，2013年以来，世界范围内泄漏的数据条数已经超过134亿。面对技术，个人是无力的，而法律监管仍不充足。","createtime":"2019-05-20 16:41:00"},{"id":9,"category":2,"title":"安卓断供：谷歌的七伤拳，华为该如何应对？","content":"据路透社报道，谷歌Alphabet已经暂停与华为的业务，这些商业往来包括硬件和软件转让与提供技术的服务，除了通过\u201c开放源码许可\u201d公开可用的服务以外。","createtime":"2019-05-20 18:44:00"},{"id":10,"category":4,"title":"新款福特金牛座官图发布，车身修长，风格更年轻","content":"从官图上看，新车仅仅是针对一部分细节进行改进，视觉效果上，大灯和中网的面积都变得更小。另外，新车继续提供Vignale版车型，部分外观套件会更加奢华。车身尺寸方面，新车长宽高分别为5018mm/1884mm/1506mm。动力方面，新车继续搭载2.0T发动机，发动机最大输出功率为244马力，传动方面或继续匹配6AT变速箱。凯迪拉克XTS降价，亚洲龙国产，你觉得二十多万的C级车市场还会有金牛座的位置吗？","createtime":"2019-05-20 12:35:00"},{"id":11,"category":4,"title":"高田安全气囊缺陷 法拉利召回458/488 GTB等","content":"日前，法拉利汽车国际贸易(上海)有限公司根据《缺陷汽车产品召回管理条例》和《缺陷汽车产品召回管理条例实施办法》的要求，向国家市场监督管理总局备案了召回计划。将自2019年7月1日起，召回进口加利福尼亚、加利福尼亚T、FF、458、F12berlinetta、F12tdf、812 Superfast、GTC4Lusso、GTC4Lusso T、488 GTB和488 Spider，共计2071辆。","createtime":"2019-05-20 09:54:00"}]
     * RESULT : S
     * ERRMSG : 成功
     */

    private List<NewListBean> ROWS_DETAIL;

    public List<NewListBean> getROWS_DETAIL() {
        return ROWS_DETAIL;
    }

    public void setROWS_DETAIL(List<NewListBean> ROWS_DETAIL) {
        this.ROWS_DETAIL = ROWS_DETAIL;
    }
}
